Autodesk.Navisworks.Api.InfoPropertyCategory
Category of properties stored in DocumentInfo and SheetInfo objects.

Autodesk.Navisworks.Api.InfoPropertyCategory.DisplayName
Get the display name.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.InfoPropertyCategory.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.InfoPropertyCategory.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.InfoPropertyCategory.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.InfoPropertyCategory.Properties
Get the properties
Throws System.ObjectDisposedException:
Object has been Disposed